Autodesk.Revit.DB.Structure.RebarSpliceError
Class that defines states for splicing a Rebar.

Autodesk.Revit.DB.Structure.RebarSpliceError.SpliceGeometryAlmostParallelToBarSegment
The plane formed by splice geometry is almost parallel to bar segment plane.

Autodesk.Revit.DB.Structure.RebarSpliceError.SpliceGeometryDoesNotIntersectAllTheBarsInTheSet
A plane obtained from splice geometry doesn't intersect all the bars in the set.

Autodesk.Revit.DB.Structure.RebarSpliceError.TooSmallSegments
One of the resulting segments is too small to apply the lap.

Autodesk.Revit.DB.Structure.RebarSpliceError.SpliceGeometryOnHookOrFillet
If the splice geometry is on a hook or a fillet, the rebar can't be spliced with it.

Autodesk.Revit.DB.Structure.RebarSpliceError.LineDoesNotIntersectRebarBoundingBox
The line doesn't intersect the rebar bounding box.

Autodesk.Revit.DB.Structure.RebarSpliceError.InvalidLineOrLinePlaneNormal
The line length is zero or the line direction is parallel with the line plane normal.

Autodesk.Revit.DB.Structure.RebarSpliceError.InvalidRebar
Free Form rebars, or Shape Driven rebars that are Multiplanar, or have a shape that whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.

Autodesk.Revit.DB.Structure.RebarSpliceError.Unknown
There is an unexpected error.

Autodesk.Revit.DB.Structure.RebarSpliceError.Success
This will be is there is no error.